

# matplotlib进行可视化-------------------------


# 时空数据可视化

# 时空数据是指带有地理位置与时间标签的数据，因此，时变数据和地理信息数据的可视化非常重要。

# 层次与网络结构数据可视化

# 网络关联关系在大数据中是一种常见的关系。网络之间的连接、层次结构、拓扑结构等都属于这种类型。

# 文本和跨媒体数据可视化

# 文本信息是大数据时代非结构化数据类型的典型代表，是互联网中最主要的信息类型。这类数据的可视化方法主要有标签云、引入时间轴的河流图等方法。

# 多变量数据可视化

# 多变量的高维数据用来描述现实世界中的复杂问题和对象




# Matplotlib模块依赖于NumPy和tkinter模块，可以绘制多种形式的图形，
# 包括线图、直方图、饼图、散点图等，图形质量满足出版要求，是数据可视化的重要工具。

# Matplotlib中应用最广的是matplotlib.pyplot模块。
# Pyplot提供了一套和Matlab类似的绘图API，使得Matplotlib的机制更像Matlab。
# 我们只需要调用Pyplot模块所提供的函数就可以实现快速绘图并设置图表的各个细节




# figure（）：创建一个新的绘图窗口。

# figtext（）：为figure添加文字 

# axes（）：为当前figure添加一个坐标轴

# plot（）：绘图函数

# polar（）：绘制极坐标图

# axis（）：获取或设置轴属性的边界方法（坐标的取值范围）

# clf   ： 清除当前figure窗口          cla  ： 清除当前axes窗口

# close      ： 关闭当前figure窗口

# subplot    ： 一个图中包含多个axes

# text（）： 在轴上添加文字

# title（）： 设置当前axes标题

# xlabel/ylabel：设置当前X轴或Y轴的标签

# hist（）：绘制直方图

# hist2d（）：绘制二维在直方图

# hold      ：设置当前图窗状态；off或者on

# imread（）：读取一个图像，从图形文件中提取数组

# legend（）：为当前axes放置标签

# pie（）：绘制饼状图

# scatter（）：做一个X和Y的散点图，其中X和Y是相同长度的序列对象

# stackplot（）：绘制一个堆叠面积图

# acorr（）：绘制X的自相关函数

# annotate（）：用箭头在指定的数据点创建一个注释或一段文本

# bar（）：绘制垂直条形图  barh（）：绘制横向条形图

# barbs（）：绘制一个倒钩的二维场


